package com.plohoy.bulls.domain;

import java.util.ArrayList;
import java.util.List;

public final class Dictums {
    private static final List<String> dictums = new ArrayList<>();

    static {
        dictums.add("Голос обладает жизнью. C помощью голоса мы можем управлять огнем, ветром и волнами. Голос передает энергию");
        dictums.add("Дух победы над одним противником тот же, что и над тысячей десятков тысяч врагов");
        dictums.add("В Стратегии важно чувствовать меч врага, но не отвлекаться его незначительными движениями");
        dictums.add("Есть две вещи, которые ты можешь делать: смотреть и видеть");
        dictums.add("Превознося достоинства цветка, мы невольно умаляем значение плода");
        dictums.add("По-настоящему умелые люди везде успевают и никогда не кажутся торопливыми");
        dictums.add("Сегодня – победи себя вчерашнего, завтра – победишь низких людей");
        dictums.add("Ошибочно думать, что позиция защиты крайне важна в искусстве меча, когда защищаться не от кого");
        dictums.add("Человек не должен зависеть от длины своего меча");
        dictums.add("Воспринимай сильно, смотри не напрягаясь");
        dictums.add("Важно видеть дальние вещи, как бы вблизи и близкие – словно издалека");
        dictums.add("Приняв Пустоту как Путь, увидишь Путь как Пустоту");
        dictums.add("Скрещивая мечи с противником, не заботься о том, рубишь ты сильно или слабо. Ты должен быть озабочен лишь тем, чтобы убить врага.");
        dictums.add("Опасна фиксация в мече, в кисти, во взгляде. Фиксация означает мертвую руку. Подвижность – это жизнь. Держи это в уме");
        dictums.add("Не обязательно начинать первым; но если противник нападает, опережай его. Ты побеждаешь тогда, когда опережаешь врага");
        dictums.add("Не допускай бесчестных мыслей");
        dictums.add("Путь – в упражнении");
        dictums.add("Различай выигрыш и потерю в делах мирских");
        dictums.add("С давних времен говорится: Большое и малое – вместе");
        dictums.add("Положение есть дух выжидания. Осознай это");
        dictums.add("Истинный Путь воина прям и честен. Ты должен вести противника и подчинить его своему духу");
        dictums.add("Если враг думает о горах, атакуй как море; если он думает о море, атакуй как гора");
        dictums.add("Пытаясь быстро двигать тяжелым мечом, ты собьешься с Пути");
        dictums.add("Все вещи влекут за собой ритм взлета и падения");
        dictums.add("Зри в корень");
        dictums.add("Лошадь воина должна быть выносливой и не иметь дефектов");
        dictums.add("Недолжно умирать с необнаженным оружием");
        dictums.add("Лишь имея один предмет, возможно понимать десять тысяч");
        dictums.add("Трудно познать себя, если не имеешь представления о других. Невозможно понять других, не познав себя");
        dictums.add("Неопытные бегуны могут казаться бегущими целый день, но достижения их жалки");
        dictums.add("Ты – военачальник, твой враг – подчинённый");
        dictums.add("Жизнь - словно листок, падающий с дерева");
        dictums.add("Чти предков. Поднимись над голодом, жаждой, личной любовью и личным страданием – существуй во благо человеческое");
        dictums.add("И в схватке и в обыденной жизни стоит быть целеустремленным, но спокойным");
        dictums.add("Мудрые мысли приходят лишь тогда, когда глупости уже сделаны");
        dictums.add("Перемены, наступающие с ходом времени, - лишь смена угла зрения на вещи");
        dictums.add("Людям свойственно смотреть на запертую дверь, не обращая внимания на отсутствие стены");
        dictums.add("Дорога возникает под ногами идущего");
        dictums.add("Начинай уже сейчас жить той жизнью, какой ты хотел бы видеть ее в конце");

    }

    public static List<String> getDictums() {
        return dictums;
    }
}
